Repository: ittner/geany-ctags-plugin
Catalog: geanygendoc/po/*.po
Languages: fr

source: Failed to resize memory output stream
fr: Impossible de redimensionner le flux de sortie mémoire

source: Argument parsing regular expression did not match (argument list was: "%s")
fr: L'expression régulière d'analyse des arguments n'a pas correspondu (la liste d'arguments était : « %s »)

source: Failed to build comment: %s
fr: Impossible de construire le commentaire : %s

source: No documentation type "%s" for language "%s"
fr: Pas de type de documentation « %s » pour le langage « %s »

source: No valid tag for line %d
fr: Pas de tag valide pour la ligne %d

source: boolean value
fr: valeur booléenne

source: invalid boolean value "%s"
fr: la valeur booléenne « %s » est invalide

source: invalid template: %s
fr: modèle invalide : %s

source: position name
fr: nom de position

source: invalid position "%s"
fr: la position « %s » est invalide

source: policy name
fr: nom de politique

source: invalid policy "%s"
fr: la politique « %s » est invalide

source: merge policy
fr: politique de fusion

source: invalid merge policy "%s"
fr: la politique de fusion « %s » est invalide

source: invalid type "%s"
fr: le type « %s » est invalide

source: Unknown type "%s". Is this a typo?
fr: Le type « %s » est inconnu. Est-ce une faute de frappe ?

source: match identifier
fr: identifiant de correspondance

source: match is empty
fr: la correspondance est vide

source: documentation type identifier
fr: identifiant de type de documentation

source: doctype
fr: type de documentation

source: invalid regular expression: %s
fr: expression régulière invalide : %s

source: invalid environment description: %s
fr: description d'environnement invalide : %s

source: section name
fr: nom de section

source: duplicated section "%s"
fr: la section « %s » est dupliquée

source: invalid section name "%s"
fr: le nom de section « %s » est invalide

source: input is empty
fr: l'entrée est vide

source: Parsing warning: %s:%u:%u: %s
fr: Avertissement d'analyse : %s:%u:%u : %s

source: Parsing error: %s:%u:%u: %s
fr: Erreur d'analyse : %s:%u:%u : %s

source: Filetype configuration file for language "%s" not found: %s
fr: Le fichier de configuration du type de fichier pour le langage « %s » n'a pas été trouvé : %s

source: Failed to load file type "%s" from file "%s": %s
fr: Impossible de charger le type de fichier « %s » depuis le fichier « %s » : %s

source: Invalid option or proxy: either the proxy's property or the option type is incompatible.
fr: Option ou proxy invalide : la propriété du proxy ou le type de l'option est incompatible.

source: Unknown value type for keyfile entry %s::%s
fr: Type de valeur inconnue pour l'entrée de fichier de clé %s::%s

source: Error retrieving keyfile entry %s::%s: %s
fr: Erreur lors de la récupération de l'entrée de fichier de clé %s::%s : %s

source: Generates documentation comments basis from source code
fr: Génères des bases de commentaires de documentation depuis le code source

source: Failed to load configuration: %s
fr: Impossible de charger la configuration : %s

source: Failed to save configuration: %s
fr: Impossible d'enregistrer la configuration : %s

source: Failed to find configuration file for file type "%s": %s
fr: Impossible de trouver le fichier de configuration pour le type de fichier « %s » : %s

source: Insert documentation comment
fr: Insérer un commentaire de documentation

source: _Document current symbol
fr: _Documenter le symbole courant

source: Generate documentation for the currently selected symbol
fr: Générer la documentation pour le symbole sélectionné

source: Document _all symbols
fr: Documenter _tous les symboles

source: Generate documentation for all the symbols in the current document
fr: Générer la documentation pour tous les symboles du fichier courant

source: _Reload configuration files
fr: _Recharger les fichiers de configuration

source: Force reloading of the configuration files
fr: Forcer le rechargement des fichiers de configuration

source: _Edit current language configuration
fr: Édit_er la configuration du langage courant

source: Open the current language configuration file for editing
fr: Ouvrir le fichier de configuration du langage courant pour l'éditer

source: _Documentation generator
fr: Générateur de _documentation

source: Documentation _type:
fr: _Type de documentation :

source: _Save file before generating comment
fr: _Enregistrer le fichier avant de générer le commentaire

source: Whether to automatically save the file to work on before inserting a comment. This is currently needed to have an up-to-date tag list. If you disable this option and ask for comment generation on a modified file, the behavior may be surprising since the comment will be generated for the last saved state and not the current state of the file.
fr: Choisis si il faut enregistrer automatiquement le fichier sur lequel travailler avant de générer un commentaire. C'est actuellement nécessaire pour avoir une liste de tags à jour. Si vous désactivez cette option et demandez la génération de commentaire pour un fichier modifié, le résultat pourrait être surprenant car le commentaire sera généré pour le dernier état enregistré et non l'état actuel du fichier.

source: file "%s" exists but is not a regular file
fr: le fichier « %s » existe mais n'est pas un fichier régulier

source: %s: no such file or directory
fr: %s : aucun fichier ou répertoire de ce type
