Repository: ittner/geany-ctags-plugin
Catalog: geanysendmail/po/*.po
Languages: de

source: A little plugin to send the current file as attachment by user's favorite mailer
de: Ein Plugin zum Senden einer Datei als Anhang unter Verwendung eines Mailprogrammes.

source: Recipient's Address
de: Emailadresse des Empfängers

source: Enter the recipient's e-mail address:
de: Emailadresse des Empfängers:

source: Plugin configuration directory could not be created.
de: Konfigurationsdatei konnte nicht erstellt werden.

source: Filename placeholder not found. The executed command might have failed.
de: Konnte den Platzhalter für den Dateinamen (\%s) nicht finden. Das angegebene Kommando könnte nicht korrekt ausgeführt worden sein.

source: Recipient address placeholder not found. The executed command might have failed.
de: Konnte den Platzhalter für den Mailempfänger nicht finden. Das angegebene Kommando könnte nicht korrekt ausgeführt worden sein.

source: Could not execute mailer. Please check your configuration.
de: Konnte das Mailprogramm nicht aufrufen. Bitte überprüfen Sie Ihre Einstellungen

source: Please define a mail client first.
de: Bitte ein Mailprogramm angeben!

source: File has to be saved before sending.
de: Die Datei muss vor dem Senden gespeichert werden.

source: Path and options for the mail client:
de: Pfad und Optionen für das Mailprogramm:

source: Note: \%f will be replaced by your file. \%r will be replaced by recipient's email address. \%b will be replaced by basename of a file Examples: sylpheed --attach "\%f" --compose "\%r" mutt -s "Sending '\%b'" -a "\%f" "\%r"
de: Anmerkung: \%f wird mit der zu sendenden Datei ersetzt. \%r wird mit der Emailadresse des Empfängers ersetzt. \%b wird mit dem reinen Dateinamen der zu sendenen Datei ersetzt. Ein Beispiel könnte sein: sylpheed --attach "\%f" --compose "\%r" mutt -s "Sending '\%b'" -a "\%f" "\%r"

source: Showing icon in toolbar
de: Symbol in der Werkzeugleiste anzeigen

source: Shows a icon in the toolbar to send file more easy.
de: Zeigt ein Symbol in der Werkzeugleiste an, sodass eine Datei einfacher versendet werden kann.

source: Using dialog for entering email address of recipients
de: Zeigt einen Dialog zum Eingeben der Emailadresse des Empfängers der zu sendenden Datei

source: Send file by mail
de: Per Mail senden

source: _Mail document
de: _Dokument versenden

source: Sends the opened file as unzipped attachment by any mailer from your $PATH
de: Sendet ein geöffnetes Dokument als ungepackten Anhang unter Verwendung eines Mailprogrammes.
