Repository: ittner/geany-ctags-plugin
Catalog: geany-plugins/geanygdb/po/*.po
Languages: ru

source: Added breakpoint #%s in %s() at %s:%s
ru: Добавлена точка останова #%s в %s() на %s:%s

source: Added breakpoint #%s at %s:%s
ru: Добавлена точка останова #%s на %s:%s

source: Added write watchpoint #%s for %s
ru: Добавлена точка контроля(для записи) #%s на %s

source: Added read/write watchpoint #%s for %s
ru: Добавлена точка контроля(для чтения/записи) #%s на %s

source: Added read watchpoint #%s for %s
ru: Добавлена точка контроля(для чтения) #%s на %s

source: Watch/breakpoint deleted.
ru: Точка останова/контроля удалена.

source: Failed to toggle breakpoint -
ru: Ошибка переключения точки останова -

source: Watch/breakpoint toggled.
ru: Точка останова/контроля переключена.

source: Watch/breakpoint modified.
ru: Точка останова/контроля изменена.

source: Failed to retrieve source search path setting from GDB.
ru: Ошибка установки пути, для поиска исходных файлов, указанного в настройках GDB.

source: Failed to retrieve executable search path setting from GDB.
ru: Ошибку установки пути, для поиска исполняемых файлов, указанного в настройках GDB.

source: Failed to retrieve working directory setting from GDB.
ru: Ошибка установки рабочего каталога, указанного в настройках GDB.

source: Field list too long, not all items can be displayed.
ru: Список полей слишком велик, не все элементы могут быть отображены.

source: Error starting target process!
ru: Ошибка запуска целевого процесса!

source: This executable does not appear to contain the required debugging information.
ru: Исполняемый файл не содержит необходимой отладочной информации.

source: Program received signal %s (%s) at %s in function %s() at %s:%s
ru: Программа получила сигнал %s (%s) по адресу %s в функции %s() на %s:%s

source: Watchpoint #%s out of scope
ru: Контрольная точка #%s вне области видимости

source: Program exited on signal %s (%s).
ru: Программа завершилась по сигналу %s (%s).

source: Unknown signal
ru: Неизвестный сигнал

source: Program exited with code %d [%s]
ru: Программа завершилась с кодом %d [%s].

source: (unknown)
ru: (неизвестно)

source: Program exited normally.
ru: Программа завершилась правильно.

source: tty temporary directory not specified!
ru: tty: директория для временных файлов не указанна!

source: tty temporary directory not found!
ru: tty: директория для временных файлов не найдена!

source: tty helper program not specified!
ru: программа ttyhelper, не указанна!

source: tty helper program not found!
ru: программа ttyhelper, не найдена!

source: Attaching to terminal %s
ru: Отправить на терминал %s

source: Timeout waiting for TTY name.
ru: Время ожидания терминала истекло.

source: GDB exited (pid=%d)
ru: Завершаем работу GDB (pid=%d)

source: Target process exited. (pid=%d; %s%s)
ru: Завершение целевого процесса. (pid=%d; %s%s)

source: code=
ru: код=

source: reason:
ru: причина:

source: Directory %s not found!
ru: Каталог %s не найден!

source: Shutting down target program.
ru: Завершение работы целевой программы.

source: Killing target program.
ru: Убить целевую программу.

source: Timeout waiting for target process.
ru: Время ожидание процесса истекло.

source: Using a bigger hammer!
ru: Используем кувалду!

source: Waiting for target process to exit.
ru: Закончилось время ожидания завершения процесса.

source: Killing GDB (pid=%d)
ru: Убиваем GDB (pid=%d)

source: Timeout trying to kill GDB.
ru: Истекло время ожидания, прерывания работы GDB.

source: Shutting down GDB
ru: Завершение работы GDB

source: Waiting for GDB to exit.
ru: Ожидание завершения GDB.

source: Timeout waiting for GDB to exit.
ru: Истекло время ожидания, завершения работы GDB.

source: Starting gdb (pid=%d)
ru: Запущен gdb (pid=%d)

source: Started target process. (pid=%d)
ru: Запуск процесса (pid=%d).

source: Stack too deep to display! (Showing only %d frame)
ru: Стек слишком велик для отображения! (Показан только %d блок)

source: No %s selected
ru: Не выбрана %s

source: watchpoint
ru: точка контроля

source: breakpoint
ru: точка останова

source: Delete selected watchpoint?
ru: Удалить контрольную точку?

source: Delete selected breakpoint?
ru: Удалить точку останова?

source: Edit watchpoint
ru: Править точку контроля

source: Edit breakpoint
ru: Править точку останова

source: Enabled
ru: Включено

source: Break after
ru: Прервать после

source: times.
ru: раз.

source: Break when
ru: Прервать когда

source: is true.
ru: это истина.

source: Add watchpoint
ru: Добавить точку контроля

source: Add breakpoint
ru: Добавить точку останова

source: Watchpoints
ru: Точки контроля

source: Breakpoints
ru: Точки останова

source: Environment settings
ru: Параметры окружения

source: Command-line arguments passed to target program:
ru: Параметры командной строки для целевой программы:

source: Search path for source files:
ru: Путь для поиска исходных файлов:

source: Working directory for target program:
ru: Рабочий каталог для целевой программы:

source: Search path for executables:
ru: Путь для поиска исполняемых файлов:

source: Select Font
ru: Выбрать шрифт

source: Preferences
ru: Настройки

source: Keep debug window on top.
ru: Окно отладки всегда поверх всех.

source: Show tooltips.
ru: Показывать подсказки

source: Show icons.
ru: Показывать иконки

source: Font for source code listings:
ru: Шрифт для исходного кода:

source: Terminal program:
ru: Терминал:

source: _Examine
ru: _Проверить

source: Object info
ru: Информация об объекте

source: Elements
ru: Элементы

source: Fields
ru: Поля

source: Return to previous dialog.
ru: Вернуться к предыдущему диалогу

source: Display additional information about the selected item.
ru: Отобразить дополнительную информацию о выбранном элементе.

source: Frame info
ru: Информация о блоке

source: Frame #%s in %s() at %s:%s
ru: Блок #%s в %s() на %s:%s

source: Function arguments
ru: Аргументы функции

source: Local variables
ru: Локальные переменные

source: Return to stack list dialog.
ru: Вернуться к диалогу просмотра стека.

source: Stack trace
ru: Трассировка стека

source: Display additional information about the selected frame.
ru: Показать дополнительную информацию о выбранном блоке.

source: Clea_r
ru: О_чистить

source: Filename:
ru: Имя файла:

source: Variable to watch:
ru: Контролировать переменную:

source: Line number or function name:
ru: Номер строки или имя функции:

source: Access trigger:
ru: Тип доступа:

source: (no program)
ru: (нет программы)

source: loaded
ru: загружено

source: starting
ru: запущено

source: running
ru: выполняется

source: stopped
ru: остановленно

source: terminated
ru: прервано

source: paused
ru: приостановленно

source: Program received signal:
ru: Программа возвратила сигнал:

source: Error:
ru: Ошибка:

source: Select executable to debug
ru: Выбор исполняемого файла для отладки

source: Debugging of object files is not supported.
ru: Отладка объектных файлов не поддерживается.

source: You don't have permission to execute this file.
ru: У Вас нет прав для выполнения этого файла.

source: Debugging of shared libraries is not supported.
ru: Отладка разделяемых библиотек не поддерживается.

source: Debugging of core files id not supported.
ru: Отладка исполняемых модулей ядра не поддерживается.

source: Target file must be ELF 32-bit x86 executable.
ru: Файл должен быть 32-разрядной(x86) исполняемой программой.

source: You don't have permission to read this file.
ru: У Вас нет прав для чтения этого файла.

source: Run to location
ru: Перейти к размещению

source: no program
ru: нет программы

source: _Load
ru: _Загрузить

source: Load target program into debugger.
ru: Загрузка программы в отладчик.

source: _Unload
ru: _Выгрузить

source: Kill the target program AND the debugger.
ru: Убить программу и отладчик.

source: _Run
ru: _Запустить

source: Execute target program in debugger.
ru: Выполнить программу в отладчике.

source: _Kill
ru: _Убить

source: Kill the target program with SIGKILL.
ru: Убить программу сигналом SIGKILL.

source: _Pause
ru: _Пауза

source: Pause the target program with SIGINT.
ru: Приостановить программу сигналом SIGINT.

source: _Continue
ru: _Продолжить

source: Continue executing target program.
ru: Продолжить выполнение программы

source: _Step
ru: Следующая _строка

source: Step to the next line or function call.
ru: Шаг к следующей строке или вызову функции.

source: Step _in
ru: Следующий _вызов

source: Execute the next machine instruction or function call.
ru: Выполнить следующую машинную команду или вызов функции.

source: Step to the next line.
ru: Переход к следующей строке

source: Ne_xt in
ru: Следующая _инструкция

source: Execute the next machine instruction.
ru: Выполнить следующую машинную команду.

source: Run _to
ru: _Перейти

source: Run to specified source line.
ru: Выполнить до указанной строки.

source: Stac_k
ru: Сте_к

source: Display a backtrace of the current call stack.
ru: Отобразить состояние стека текущего вызова.

source: Add or remove breakpoints.
ru: Добавить или удалить точку останова.

source: Add or remove watchpoints.
ru: Добавить или удалить контрольную точку.

source: _Finish
ru: _Завершить

source: Complete the currently executing function.
ru: Завершить исполнение текущей функции.

source: _Return
ru: _Возврат

source: Return immediately from the current function.
ru: Принудительно выйти из текущей функции.

source: En_viron
ru: _Окружение

source: Set target environment and command line options.
ru: Установка окружения и опций командной строки.

source: _Options
ru: _Опции

source: Set user interface options.
ru: Установка опций пользовательского интерфейса.

source: Run in terminal
ru: Запуск в терминале

source: Execute target program inside a terminal window.
ru: Выполнить программу в окне терминала.

source: Ignore SIGPIPE
ru: Игнорировать SIGPIPE

source: Don't pause execution when target gets a SIGPIPE signal. (Useful for certain networking applications.)
ru: Не приостанавливать выполнение, когда цель получает сигнал SIGPIPE (Полезно для определённых сетевых приложений.)

source: Console:
ru: Консоль:

source: Send a GDB command directly to the debugger.
ru: Послать команду непосредственно в отладчик.

source: _Quit
ru: _Выйти

source: Exit everything
ru: Закрыть все

source: Debugger
ru: Отладчик

source: Integrated debugging with GDB.
ru: Комплексная отладка в GDB.

source: Jeff Pohlmeyer
ru: Джефф Похлмейер(Jeff Pohlmeyer)

source: Plugin configuration directory (%s) could not be created.
ru: Не возможно создать каталог настройки плагинов (%s).

source: geanygdb: ttyhelper program not found.
ru: geanygdb: программа ttyhelper, не найдена.
