Repository: ittner/geany-ctags-plugin
Catalog: geanyinsertnum/po/*.po
Languages: bg

source: Insert Numbers
bg: Вмъкване на числа

source: Insert/Fill columns with numbers.
bg: Вмъкване/запълване на колони с числа.

source: Counting...
bg: Преброяване...

source: Preparing...
bg: Подготовка...

source: Inserting...
bg: Вмъкване...

source: For base 11 and above
bg: За бройна система 11 и нагоре

source: _Start:
bg: _Начално число:

source: S_tep:
bg: _Стъпка:

source: _Base:
bg: _Бройна система:

source: Letters:
bg: Букви:

source: _Upper
bg: _Главни

source: _Lower
bg: _Малки

source: Base _prefix
bg: Системен _префикс

source: 0 for octal, 0x for hex, + for positive decimal
bg: 0 за осмични числа, 0x за шестнайсетични, + за положителни десетични

source: Padding:
bg: Запълване:

source: Sp_ace
bg: _Интервали

source: _Zero
bg: Н_ули

source: Insert _Numbers
bg: Вмъкване на _числа
