Repository: ittner/geany-ctags-plugin
Catalog: backupcopy/po/*.po
Languages: de

source: Backup Copy
de: Sicherheitskopien anlegen

source: Creates a backup of the current file when saving
de: Legt eine Sicherungskopie der aktuellen Datei beim Speichern an

source: Backup Copy: Directory could not be created (%s).
de: Sicherungskopien: Verzeichnis konnte nicht gespeichert werden (%s).

source: Backup Copy: File could not be read (%s).
de: Sicherungskopien: Datei konnte nicht gelesen werden (%s).

source: Backup Copy: File could not be saved (%s).
de: Sicherungskopien: Datei konnte nicht gespeichert werden (%s).

source: Select Directory
de: Verzeichnis wählen

source: Plugin configuration directory could not be created.
de: Das Konfigurationsverzeichnis für das Plugin konnte nicht erstellt werden.

source: Backup directory does not exist or is not writable.
de: Das Verzeichnis für die Sicherungsdateien existiert nicht oder kann nicht geschrieben werden.

source: Directory to save backup files in:
de: Verzeichnis um die Sicherungskopien zu speichern:

source: Date/Time format for backup files ("man strftime" for details):
de: Datums-/Zeitformat für die Sicherungsdateien ("man strftime" für mehr Informationen):

source: Directory levels to include in the backup destination:
de: Verzeichnisebenen die im Zielpfad übernommen werden sollen:
